app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "services" WHERE (categories.id = 1)
---
  def index
    id = params[:id]
    categories = Category.all
    category_with_users = []
    categories.each { |cat|
      resp = {}
      resp["name"] = cat.name
      resp["amount_users"] = Service.where('category_id = ?', cat.id).count

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT "services".* FROM "services" WHERE (category_id = 1)
---
  def show
    id = params[:id]
    resp = {}
    categorie = Category.find(id)
    resp["name"] = categorie.name
    resp["users"] = Service.where('category_id = ?', categorie.id)

INSERT INTO "categories" ("name", "url_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "teste"], ["url_image", "mypic"], ["created_at", 2016-09-29 23:50:13 UTC], ["updated_at", 2016-09-29 23:50:13 UTC]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 14]]
---
  def destroy
    if @category.destroy