app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "authentication_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authentication_token", "UstiD29zzqujAfwyCUAT"], ["updated_at", 2016-11-18 12:41:50 UTC], ["id", 1]]
---
	def set_app_id
		user = User.find(params[:user_id])
		if user
			app_id = params[:app_id];
			unless app_id
				return render :json=> {:success=>false,:message=>"Error on register app id missing"}
			end
			user.app_id = app_id
			if user.save