app/controllers/requests_controller.rb

INSERT INTO "requests" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", 2016-11-18 13:49:37 UTC], ["updated_at", 2016-11-18 13:49:37 UTC]]
---
  def create
    @request = Request.new(request_params)
    if @request.save