app/controllers/services_controller.rb

INSERT INTO "services" ("user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 0], ["category_id", 123456], ["created_at", 2016-10-01 12:56:12 UTC], ["updated_at", 2016-10-01 12:56:12 UTC]]
---
  def create
    @service = Service.new(service_params)
    if @service.save

SELECT "services".* FROM "services" WHERE "services"."id" IN (NULL, NULL)
---
    def set_service
      @service = Service.find(params[:id])