app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token", "site") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save