app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["authentication_token", "BsH7qWs9WzsNkgsydNiX"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "services" WHERE (category_id = 1)
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "services".* FROM "services" WHERE (user_id = 31)
SELECT "services".* FROM "services"
---
  def sync
    if params.key? :authentication_token
        token = params[:authentication_token]
        id = params[:id]
        user = User.find_for_database_authentication(authentication_token: token)
        if user
          response  = {}
          response['profile'] = user
          cats = Category.all
          category_with_users = []
          cats.each { |cat|
            resp = {}
            resp["name"] = cat.name
            resp["amount_users"] = Service.where('category_id = ?', cat.id).count
            resp["url_image"] = cat.url_image
            resp["id"] = cat.id
            category_with_users << resp
          }
          response['categories'] = category_with_users
          users = User.all
          professionals = []
          users.each { |user|
            resp = {}
            user_categories = Service.where('user_id = ?', user.id)
            if user_categories.any?

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "gleilson@gmail.com.br"], ["LIMIT", 1]]
---
  def create
    resource = User.find_for_database_authentication(email: params[:email])